<?php

const PATTERN_GEO = "/^[А-яёЁA-z]+([-\s][А-яёЁA-z]+){0,2}$/u";
const PATTERN_NAME = "/^[А-яёЁA-z]+$/u";
const PATTERN_EMAIL = "/^(?:[A-zА-яёЁ\d!#$%&'*+=?^_`{|}~-]+(?:\.[A-zА-яёЁ\d!#$%&'*+=?^_`{|}~-]+)*|\"(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21\x23-\x5b\x5d-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])*\")@(?:(?:[A-zА-яёЁ\d](?:[A-zА-яёЁ\d-]*[A-zА-яёЁ\d])?\.)+[A-zА-яёЁ\d](?:[A-zА-яёЁ\d-]*[A-zА-яёЁ\d])?|\[(?:(?:25[0-5]|2[0-4][\d]|[01]?[\d][\d]?)\.){3}(?:25[0-5]|2[0-4][\d]|[01]?[\d][\d]?|[A-zА-яёЁ\d-]*[A-zА-яёЁ\d]:(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21-\x5a\x53-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])+)])$/u";
const PATTERN_PASSWORD = "/^[A-z\d@#\$%]*(?=\S{6,})(?=\S*[A-z])(?=\S*[\d])(?=\S*[@#\$%])[A-z\d@#\$%]*$/u";